guiba2s/STM32/STM32F103C8/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DIN_BTN_DECRES_Pin GPIO_PIN_4
#define DIN_BTN_DECRES_GPIO_Port GPIOA
#define DOUT_LED1_Pin GPIO_PIN_0
#define DOUT_LED1_GPIO_Port GPIOB
#define DIN_BTN_ALLON_Pin GPIO_PIN_1
#define DIN_BTN_ALLON_GPIO_Port GPIOB
#define DOUT_LED5_Pin GPIO_PIN_8
#define DOUT_LED5_GPIO_Port GPIOA
#define DOUT_LED6_Pin GPIO_PIN_9
#define DOUT_LED6_GPIO_Port GPIOA
#define DOUT_LED7_Pin GPIO_PIN_10
#define DOUT_LED7_GPIO_Port GPIOA
#define DOUT_LED8_Pin GPIO_PIN_12
#define DOUT_LED8_GPIO_Port GPIOA
#define DOUT_LED2_Pin GPIO_PIN_3
#define DOUT_LED2_GPIO_Port GPIOB
#define DOUT_LED3_Pin GPIO_PIN_4
#define DOUT_LED3_GPIO_Port GPIOB
#define DOUT_LED4_Pin GPIO_PIN_5
#define DOUT_LED4_GPIO_Port GPIOB
#define DIN_BTN_OFF_Pin GPIO_PIN_8
#define DIN_BTN_OFF_GPIO_Port GPIOB
#define DIN_BTN_SEQC_Pin GPIO_PIN_9
#define DIN_BTN_SEQC_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
